In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [ ]:
# merge can be used for JOIN-ing dataframes
# it is also good for "concatination"

In [3]:
dframe1 = DataFrame(
    {
    'key':['X','Z','Y','Z','X','X'],
    'data_set_1':np.arange(6)
    })

In [4]:
dframe1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   Z
4           4   X
5           5   X

In [8]:
dframe2 = DataFrame(
    {
    'key':['Q','Y','Z'],
    'data_set_2':[1,2,3]
    })

In [9]:
dframe2

   data_set_2 key
0           1   Q
1           2   Y
2           3   Z

In [10]:
pd.merge(dframe1,dframe2)

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [11]:
pd.merge(dframe1,dframe2, on='key')

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [12]:
pd.merge(dframe1,dframe2, on='key', how="left")

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Z           3
2           2   Y           2
3           3   Z           3
4           4   X         NaN
5           5   X         NaN

In [13]:
pd.merge(dframe1,dframe2, on='key', how="right")

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2
3         NaN   Q           1

In [14]:
pd.merge(dframe1,dframe2, on='key', how="outer")

   data_set_1 key  data_set_2
0           0   X         NaN
1           4   X         NaN
2           5   X         NaN
3           1   Z           3
4           3   Z           3
5           2   Y           2
6         NaN   Q           1

In [15]:
dframe3 = DataFrame(
    {
        'key': ['X','X','X','Y','Z','Z'],
        'dataset_3':range(6)
    }
)

In [16]:
dframe3

   dataset_3 key
0          0   X
1          1   X
2          2   X
3          3   Y
4          4   Z
5          5   Z

In [18]:
dframe4 = DataFrame(
    {
        'key': ['Y','Y','X','X','Z'],
        'dataset_4':range(5)
    }
)

In [19]:
dframe4

   dataset_4 key
0          0   Y
1          1   Y
2          2   X
3          3   X
4          4   Z

In [21]:
pd.merge(dframe3,dframe4)

   dataset_3 key  dataset_4
0          0   X          2
1          0   X          3
2          1   X          2
3          1   X          3
4          2   X          2
5          2   X          3
6          3   Y          0
7          3   Y          1
8          4   Z          4
9          5   Z          4

In [23]:
df_left = DataFrame(
    {
        'key1': ['SF','SF','LA'],
        'key2': ['one', 'two', 'one'],
        'left_data': [10, 20, 30]
    })

In [24]:
df_right = DataFrame(
    {
        'key1': ['SF','SF','LA','LA'],
        'key2': ['one', 'one', 'one','two'],
        'left_data': [40, 50, 60, 70]
    })

In [25]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [26]:
df_right

  key1 key2  left_data
0   SF  one         40
1   SF  one         50
2   LA  one         60
3   LA  two         70

In [28]:
pd.merge(df_left,df_right, on=['key1', 'key2'], how='outer')

  key1 key2  left_data_x  left_data_y
0   SF  one           10           40
1   SF  one           10           50
2   SF  two           20          NaN
3   LA  one           30           60
4   LA  two          NaN           70

In [29]:
pd.merge(df_left,df_right, on=['key1', 'key2'])

  key1 key2  left_data_x  left_data_y
0   SF  one           10           40
1   SF  one           10           50
2   LA  one           30           60

In [30]:
pd.merge(df_left, df_right, on="key1")

  key1 key2_x  left_data_x key2_y  left_data_y
0   SF    one           10    one           40
1   SF    one           10    one           50
2   SF    two           20    one           40
3   SF    two           20    one           50
4   LA    one           30    one           60
5   LA    one           30    two           70

In [33]:
pd.merge(df_left, df_right, on="key1", suffixes=("_lefty", "_righty"))

  key1 key2_lefty  left_data_lefty key2_righty  left_data_righty
0   SF        one               10         one                40
1   SF        one               10         one                50
2   SF        two               20         one                40
3   SF        two               20         one                50
4   LA        one               30         one                60
5   LA        one               30         two                70

NameError: name 'df_left_hr' is not defined